day1/load_testing/logs/async_sleep_2/passenger/siege_test_case_01.log
** SIEGE 4.1.7
** Preparing 30 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        5    hits
Availability:		      100.00 %
Elapsed time:		       10.86 secs
Data transferred:	        0.00 MB
Response time:		     6028.00 ms
Transaction rate:	        0.46 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        2.78
Successful transactions:        5
Failed transactions:	        0
Longest transaction:	    10040.00 ms
Shortest transaction:	     2020.00 ms
 
** SIEGE 4.1.7
** Preparing 40 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		        0    hits
Availability:		        0.00 %
Elapsed time:		       10.97 secs
Data transferred:	        0.00 MB
Response time:		        0.00 ms
Transaction rate:	        0.00 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		        0.00
Successful transactions:        0
Failed transactions:	        0
Longest transaction:	        0.00 ms
Shortest transaction:	        0.00 ms
 
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...
HT
Lifting the server siege...siege aborted due to excessive socket failure; you
can change the failure threshold in $HOME/.siegerc

Transactions:		        0    hits
Availability:		        0.00 %
Elapsed time:		       10.95 secs
Data transferred:	        0.19 MB
Response time:		        0.00 ms
Transaction rate:	        0.00 trans/sec
Throughput:		        0.02 MB/sec
Concurrency:		        0.07
Successful transactions:        0
Failed transactions:	     1032
Longest transaction:	       10.00 ms
Shortest transaction:	        0.00 ms
 
TP/1.1 503     0.00 secs:     189 bytes ==> GET  /async_sleep/2