day1/load_testing/logs/async_sleep_2/passenger/siege_test_case_02.log
** SIEGE 4.1.7
** Preparing 50 concurrent users for battle.
The server is now under siege...

Lifting the server siege...
Transactions:		       29    hits
Availability:		      100.00 %
Elapsed time:		       60.12 secs
Data transferred:	        0.00 MB
Response time:		    30131.04 ms
Transaction rate:	        0.48 trans/sec
Throughput:		        0.00 MB/sec
Concurrency:		       14.53
Successful transactions:       29
Failed transactions:	        0
Longest transaction:	    58230.00 ms
Shortest transaction:	     2020.00 ms